# Introduction to Pandas: A Short Tutorial

* Pandas is an open source, BSD-licensed library
* High-performance, easy-to-use data structures and data analysis tools
* Built on top of NumPy, and provides an efficient implementation of a DataFrame
* Makes data analysis fast and easy in Python

** DataFrame **: A multidimensional array with attached row and column labels

**Pandas API Reference**: https://pandas.pydata.org/pandas-docs/stable/reference/index.html

### This is an introduction to Pandas. You can try to complete the tutorial yourself and check the model answers for help, when needed

In [3]:
# Import Pandas
import pandas as pd

In [4]:
# Create two lists with information from Baby names in England and Wales: 2018
# https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/livebirths/
names  = ['Adam', 'Sophie', 'Charlie', 'Anna', 'Bobby', 'Florence', 'George', 'Mia']
births = [1508,   1929,      3336,     409,     652,    1974,        4949,    2418]

# Merge these two lists together using the zip function
# https://docs.python.org/3.3/library/functions.html
babiesDataSet = list(zip(names, births))

In [5]:
# Print the combined list
babiesDataSet

[('Adam', 1508),
 ('Sophie', 1929),
 ('Charlie', 3336),
 ('Anna', 409),
 ('Bobby', 652),
 ('Florence', 1974),
 ('George', 4949),
 ('Mia', 2418)]

In [6]:
# Use Pandas to create a dataframe
df = pd.DataFrame(data=babiesDataSet, columns=["Name", "Births"])

In [7]:
# Display the dataframe
df

       Name  Births
0      Adam    1508
1    Sophie    1929
2   Charlie    3336
3      Anna     409
4     Bobby     652
5  Florence    1974
6    George    4949
7       Mia    2418

In [8]:
# Export the dataframe to csv
df.to_csv("birthsUK2018.csv", index=False, header=False)

In [9]:
# Import data to dataframe
file = "birthsUK2018.csv" #location is relative
births = pd.read_csv(file, header=None, names=["Name", "Births"])

In [10]:
# Show the dataframe
# The numbers [0,1,2,3,4] in the first column are part of the index of the dataframe. 
births #if the previous cell not run, will print the second list created in first cell also called births

       Name  Births
0      Adam    1508
1    Sophie    1929
2   Charlie    3336
3      Anna     409
4     Bobby     652
5  Florence    1974
6    George    4949
7       Mia    2418

In [11]:
# Check the data types of columns
births.dtypes

Name      object
Births     int64
dtype: object

In [12]:
# Get general info about the dataframe
# - There are 8 records in the data set
# - There is a column named "Name" of type object (non numeric) with 8 values
# - There is a column named "Births" of type numeric with 8 values
# Write your code here
births.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
Name      8 non-null object
Births    8 non-null int64
dtypes: int64(1), object(1)
memory usage: 136.0+ bytes

In [13]:
# Check the data types of Births column
# Write your code here
births.Births.dtype

dtype('int64')

In [14]:
# Print the top 5 rows
# Write your code here
births.head()

      Name  Births
0     Adam    1508
1   Sophie    1929
2  Charlie    3336
3     Anna     409
4    Bobby     652

In [15]:
# Print the last 5 rows
# Write your code here
births.tail()

       Name  Births
3      Anna     409
4     Bobby     652
5  Florence    1974
6    George    4949
7       Mia    2418

In [16]:
# Get the name of columns
# Write your code here
births.columns

Index(['Name', 'Births'], dtype='object')

In [17]:
# Get the dataframe as an array 
# Write your code here
df.values

array([['Adam', 1508],
       ['Sophie', 1929],
       ['Charlie', 3336],
       ['Anna', 409],
       ['Bobby', 652],
       ['Florence', 1974],
       ['George', 4949],
       ['Mia', 2418]], dtype=object)

In [18]:
# Get the index of the dataframe
# Write your code here
births.index

RangeIndex(start=0, stop=8, step=1)

In [19]:
# Access the names column by slicing
# Write your code here
births["Births"]

0    1508
1    1929
2    3336
3     409
4     652
5    1974
6    4949
7    2418
Name: Births, dtype: int64

In [20]:
# Access the Births column as a property
# Write your code here
births.Name #essentially same as above, hummmm

0        Adam
1      Sophie
2     Charlie
3        Anna
4       Bobby
5    Florence
6      George
7         Mia
Name: Name, dtype: object

In [21]:
# Find the maximum number of births
# Write your code here
births.Births.max() #or: births["Births"].max()

4949

In [22]:
# Get the name associated with the max births
# Write your code here
births["Name"][df["Births"]==df["Births"].max()].values

array(['George'], dtype=object)

In [23]:
# Find the unique names
# Write your code here
births["Name"].unique()

array(['Adam', 'Sophie', 'Charlie', 'Anna', 'Bobby', 'Florence', 'George',
       'Mia'], dtype=object)

In [24]:
# Get some descriptive statistics for the number of births
# Write your code here
births["Births"].describe()

count       8.000000
mean     2146.875000
std      1467.739218
min       409.000000
25%      1294.000000
50%      1951.500000
75%      2647.500000
max      4949.000000
Name: Births, dtype: float64

In [25]:
# Get the names with births more than 2000
# Write your code here
births[births["Births"] > 2000]

      Name  Births
2  Charlie    3336
6   George    4949
7      Mia    2418

In [26]:
# Get the names starting with "A"
# Write your code here
births[births["Name"].str.contains("A")]

   Name  Births
0  Adam    1508
3  Anna     409

In [52]:
# Add another column with the country set for all rows as UK
# Tip Use numpy function repeat (if needed)
# Write your code here
import numpy as np
births["Country"] = np.repeat("UK", len(births))
births

       Name  Births Country  Gender
0      Adam    1508      UK    Male
1    Sophie    1929      UK  Female
2   Charlie    3336      UK    Male
3      Anna     409      UK  Female
4     Bobby     652      UK    Male
5  Florence    1974      UK  Female
6    George    4949      UK    Male
7       Mia    2418      UK  Female

In [50]:
# Add a column with the gender of the babies
# Assume the genders are alternating "Male", "Female"
# e.g., Adam -> Male, Sophie -> Female, Charlie -> Male, Anna -> Female etc
# Tip: Use numpy function tile if needed
# Write your code here
gender = np.tile(("Male" "Female"), int(len(births)/2))
births["Gender"] = gender
births

       Name  Births Country  Gender
0      Adam    1508      UK    Male
1    Sophie    1929      UK  Female
2   Charlie    3336      UK    Male
3      Anna     409      UK  Female
4     Bobby     652      UK    Male
5  Florence    1974      UK  Female
6    George    4949      UK    Male
7       Mia    2418      UK  Female

In [68]:
# Add a column the indicates for each name its percentage over the total births
# Write your code here
births["Percentage"] = (births["Births"]/births["Births"].sum())*100
births

       Name  Births Country  Gender  Percentage
0      Adam    1508      UK    Male    8.780204
1    Sophie    1929      UK  Female   11.231441
2   Charlie    3336      UK    Male   19.423581
3      Anna     409      UK  Female    2.381368
4     Bobby     652      UK    Male    3.796215
5  Florence    1974      UK  Female   11.493450
6    George    4949      UK    Male   28.815138
7       Mia    2418      UK  Female   14.078603

In [69]:
# Delete the country column
# Write your code here
births.drop("Country", axis=1)
births

       Name  Births  Gender  Percentage
0      Adam    1508    Male    8.780204
1    Sophie    1929  Female   11.231441
2   Charlie    3336    Male   19.423581
3      Anna     409  Female    2.381368
4     Bobby     652    Male    3.796215
5  Florence    1974  Female   11.493450
6    George    4949    Male   28.815138
7       Mia    2418  Female   14.078603

In [78]:
# Store and print to a new dataframe only columns Name, Births, and Percentage
# Write your code here
births[["Name", "Births", "Percentage"]]

       Name  Births  Percentage
0      Adam    1508    8.780204
1    Sophie    1929   11.231441
2   Charlie    3336   19.423581
3      Anna     409    2.381368
4     Bobby     652    3.796215
5  Florence    1974   11.493450
6    George    4949   28.815138
7       Mia    2418   14.078603

In [81]:
# Subset the data based on index location to get the first 3 records
# Tip: Use the iloc property of the dataframe
# Write your code here
births.iloc[:3] #or births.iloc[[0, 1, 2]]

      Name  Births Country  Gender  Percentage
0     Adam    1508      UK    Male    8.780204
1   Sophie    1929      UK  Female   11.231441
2  Charlie    3336      UK    Male   19.423581

In [83]:
# Get the number of births for the name at index 0
# Tip: Use the 'at' property of a dataframe
# Write your code here
births.at[0, "Births"] #alternative that is longwinded but how I ended up doing it by using the internet as a resource as Computer Scientests are meant to but I am usually too lazt too: births.loc[0].at["Births"]

1508

In [85]:
# Get the names that belong to female babies
# Tip: Look up the query function of a dataframe
# Write your code here
births.query("Gender == 'Female'")

       Name  Births Country  Gender  Percentage
1    Sophie    1929      UK  Female   11.231441
3      Anna     409      UK  Female    2.381368
5  Florence    1974      UK  Female   11.493450
7       Mia    2418      UK  Female   14.078603

In [87]:
# Get the names whose births are below 1000 and are male
# Tip: Look up the query function of a dataframe
# Write your code here
births.query("Births < 1000 and Gender == 'Male'")

    Name  Births Country Gender  Percentage
4  Bobby     652      UK   Male    3.796215

In [88]:
# Get the number of births by gender
# Write your code here
births_by_gender = births.groupby("Gender").sum()
births_by_gender

        Births  Percentage
Gender
Female    6730   39.184862
Male     10445   60.815138

In [90]:
# Sort the dataframe by name
# Write your code here
births.sort_values(by="Births", ascending=False)

       Name  Births Country  Gender  Percentage
6    George    4949      UK    Male   28.815138
2   Charlie    3336      UK    Male   19.423581
7       Mia    2418      UK  Female   14.078603
5  Florence    1974      UK  Female   11.493450
1    Sophie    1929      UK  Female   11.231441
0      Adam    1508      UK    Male    8.780204
4     Bobby     652      UK    Male    3.796215
3      Anna     409      UK  Female    2.381368

In [91]:
# Sort the dataframe by the number of births in descending order
# Write your code here
births.sort_values(by="Births", ascending=True)

       Name  Births Country  Gender  Percentage
3      Anna     409      UK  Female    2.381368
4     Bobby     652      UK    Male    3.796215
0      Adam    1508      UK    Male    8.780204
1    Sophie    1929      UK  Female   11.231441
5  Florence    1974      UK  Female   11.493450
7       Mia    2418      UK  Female   14.078603
2   Charlie    3336      UK    Male   19.423581
6    George    4949      UK    Male   28.815138

In [92]:
# Add a column with the county each child has been born in as given by the list below
county = ['Yorkshire', 'Essex', 'Yorkshire', 'Yorkshire', 'Kent', 'Kent', 'Yorkshire', 'Essex']
# Write your code here
births["County"] = county
births

       Name  Births Country  Gender  Percentage     County
0      Adam    1508      UK    Male    8.780204  Yorkshire
1    Sophie    1929      UK  Female   11.231441      Essex
2   Charlie    3336      UK    Male   19.423581  Yorkshire
3      Anna     409      UK  Female    2.381368  Yorkshire
4     Bobby     652      UK    Male    3.796215       Kent
5  Florence    1974      UK  Female   11.493450       Kent
6    George    4949      UK    Male   28.815138  Yorkshire
7       Mia    2418      UK  Female   14.078603      Essex

In [96]:
# Group the data based on Gender and then by County
# Write your code here
births.groupby(["Gender", "County"]).sum()

                  Births  Percentage
Gender County
Female Essex        4347   25.310044
       Kent         1974   11.493450
       Yorkshire     409    2.381368
Male   Kent          652    3.796215
       Yorkshire    9793   57.018923

In [ ]:
S